In [1]:
import pandas as pd

In [2]:
s1=pd.Series([1,2,3])

In [3]:
s1

0    1
1    2
2    3
dtype: int64

In [4]:
s1=pd.Series([1,2,3],index=('a','b','c'))

In [5]:
s1

a    1
b    2
c    3
dtype: int64

In [6]:
#converting dictionary into series
s2=pd.Series({'a':10,'b':20,'c':30})

##

In [7]:
s2

a    10
b    20
c    30
dtype: int64

In [8]:
s2=pd.Series({'a':10,'b':20,'c':30},index=('c','b','a'))

In [9]:
s2#index positon changed

c    30
b    20
a    10
dtype: int64

In [10]:
#extracting series element

In [11]:
s2=pd.Series([10,20,30,40,50,60,70,80,90,100])

In [12]:
s2[0]

10

In [13]:
s2[0:1]

0    10
dtype: int64

In [14]:
s2[1:2]

1    20
dtype: int64

In [15]:
s2[-2:-1]

8    90
dtype: int64

In [16]:
s2[-5:]

5     60
6     70
7     80
8     90
9    100
dtype: int64

In [17]:
s2[0:-5]

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [18]:
s4=pd.Series([10,20,30,60,90])

In [19]:
s4+7

0    17
1    27
2    37
3    67
4    97
dtype: int64

In [20]:
s4+s2

0     20.0
1     40.0
2     60.0
3    100.0
4    140.0
5      NaN
6      NaN
7      NaN
8      NaN
9      NaN
dtype: float64

In [21]:
s4/s2

0    1.0
1    1.0
2    1.0
3    1.5
4    1.8
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

In [22]:
#data frame
y=pd.DataFrame({'name':('A','B','C'),'MARKS':(20,22,21)})

In [23]:
y

  name  MARKS
0    A     20
1    B     22
2    C     21

In [24]:
pd.__version__

'1.0.5'

In [25]:
df=pd.read_excel(r'C:\data.xlsx')
print(df.head())

  name  marks
0    A      1
1    B      2
2    C      3
3    D      4
4    E      5

In [26]:
df.head()

  name  marks
0    A      1
1    B      2
2    C      3
3    D      4
4    E      5

In [27]:
df.tail()

   name  marks
7     H      8
8     I      9
9     J      4
10    K      7
11    L      8

In [28]:
df.shape

(12, 2)

In [29]:
df.describe()

           marks
count  12.000000
mean    5.333333
std     2.570226
min     1.000000
25%     3.750000
50%     5.500000
75%     7.250000
max     9.000000

In [30]:
df.shape

(12, 2)

In [33]:
df.iloc[0:4,0:2]

  name  marks
0    A      1
1    B      2
2    C      3
3    D      4

In [36]:
df.loc[0:9,('name','marks')]#last no. 9 is included in loc

  name  marks
0    A      1
1    B      2
2    C      3
3    D      4
4    E      5
5    F      6
6    G      7
7    H      8
8    I      9
9    J      4

In [40]:
df.drop('name',axis=1)

    marks
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9       4
10      7
11      8

In [41]:
df

   name  marks
0     A      1
1     B      2
2     C      3
3     D      4
4     E      5
5     F      6
6     G      7
7     H      8
8     I      9
9     J      4
10    K      7
11    L      8

In [42]:
df.drop([3,4,5],axis=0)#values of index 3,4,5 deleted

   name  marks
0     A      1
1     B      2
2     C      3
6     G      7
7     H      8
8     I      9
9     J      4
10    K      7
11    L      8

In [43]:
df.mean()

marks    5.333333
dtype: float64

In [44]:
df.median()

marks    5.5
dtype: float64

In [45]:
df.mode()

   name  marks
0     A    4.0
1     B    7.0
2     C    8.0
3     D    NaN
4     E    NaN
5     F    NaN
6     G    NaN
7     H    NaN
8     I    NaN
9     J    NaN
10    K    NaN
11    L    NaN

In [46]:
df.min()

name     A
marks    1
dtype: object

In [47]:
df.max()

name     L
marks    9
dtype: object

In [48]:
def half(values):
    return values/2

In [55]:
df['marks'].apply(half)

0     0.5
1     1.0
2     1.5
3     2.0
4     2.5
5     3.0
6     3.5
7     4.0
8     4.5
9     2.0
10    3.5
11    4.0
Name: marks, dtype: float64

In [54]:
y

0     0.5
1     1.0
2     1.5
3     2.0
4     2.5
5     3.0
6     3.5
7     4.0
8     4.5
9     2.0
10    3.5
11    4.0
Name: marks, dtype: float64

In [57]:
df['marks'].value_counts()

8    2
7    2
4    2
9    1
6    1
5    1
3    1
2    1
1    1
Name: marks, dtype: int64

In [58]:
df.sort_values(by='marks')

   name  marks
0     A      1
1     B      2
2     C      3
3     D      4
9     J      4
4     E      5
5     F      6
6     G      7
10    K      7
7     H      8
11    L      8
8     I      9